/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yshawn <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/12 18:29:53 by yshawn            #+#    #+#             */
/*   Updated: 2019/12/19 23:39:59 by yshawn           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <stdlib.h>

// проверено на %d
// '+' > ' ' > '-' > '0'
// когда есть '-' (минус), '0' (ноль) игнорируется
// когда есть +, пробел игнорируется

int main()
{
	printf("%0i\n", 10);
	printf("%.5i\n", 10);
	printf("%010.5i\n", 10);
	printf("%+010.5i\n", 10);
	printf("%-+10.5i\n", 10);
	return (0);
}
